{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_24", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 8, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input", "optional": false}, "name": "lstm_input", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "sequential_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 8, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_5", "optional": false}}, {"class_name": "LSTM", "config": {"name": "lstm_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"name": "lstm_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}], "build_input_shape": [null, 8, 12]}, "name": "sequential_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 12], "dtype": "float32", "keras_history": ["lstm_input", 0, 0]}}], "kwargs": {"mask": null}}]}], "input_layers": ["lstm_input", 0, 0], "output_layers": ["sequential_5", 0, 0]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "lstm_10/lstm_cell/kernel", "shape": [12, 512], "dtype": "float32"}, {"name": "lstm_10/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_10/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [128], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [64], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [32, 3], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [64], "dtype": "float32"}]}]}